package _0812mission;

public class _08 {

	public static void main(String[] args) {
		/* 
		 * 철수는 배열의 0번 인덱스에 가장 큰 값을 저장하면 될 것이라고 생각한다.
		 * 0번 인덱스가 가장 큰 값이라고 정의하고 1번부터 마지막까지 순회하면서
		 * 가장 큰 값이 나오면 가장 큰 값을 갱신한다.
		 * 위와 같은 방식으로 가장 큰 수를 구하시오.
		 * 
		 * 분석 
		 * 0번 인덱스 부터 비교하여 가장 큰수가 나오면 새로저장한다.
		 * 
		 * 진행
		 * 새로운 인덱스를 비교해야 하니 반복문을 작성한다.
		 * 인덱스를 비교할때마다 이전 인덱스와 비교하여 큰수를 확인한다
		 * 새로운 인덱스가 더 큰수면 big 변수에 새로 저장한다
		 * 마지막까지 돌면 변수를 출력한다
		 * 
		*/
		
		
		int big = 0;
		int[] a = {34,2,35,8,31,45};
		for (int i = 0; i < a.length;i++) {
			if (a[i] > big) {
				big = a[i];
			}
		} System.out.println(big);
					
	}

}
